app/views/recipes/show.html.erb

SELECT "quantities".* FROM "quantities" WHERE "quantities"."recipe_id" = $1  [["recipe_id", 4]]
---
<h3>Ingredients:</h3>
<% @recipe.quantities.each do |quantity| %>