app/views/recipes/show.html.erb

<h3>Ingredients:</h3>
<% @recipe.ingredients.each do |ingredient| %>
---
SELECT  "ingredients".* FROM "ingredients" INNER JOIN "ingredients_recipes" ON "ingredients"."id" = "ingredients_recipes"."ingredient_id" WHERE "ingredients_recipes"."recipe_id" = $1 AND "ingredients"."id" = $2 LIMIT 1  [["recipe_id", 2], ["id", 1]]