app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Fruit"], ["created_at", "2015-12-20 14:56:49.866867"], ["updated_at", "2015-12-20 14:56:49.866867"]]
---
    def create
      Category.create(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Fruity tooty"], ["updated_at", "2015-12-20 15:12:37.437915"], ["id", 4]]
---
    def update
       @category = Category.find(params[:id])
       @category.update(category_params)