app/controllers/recipes_controller.rb

    def new
      @recipe = Recipe.new
      @categories = Category.all
---
SELECT "categories".* FROM "categories"

    def create
      Recipe.create(recipe_params)
---
INSERT INTO "recipes" ("name", "description", "instructions", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "asd"], ["description", "asd"], ["instructions", "asd"], ["category_id", 1], ["created_at", "2015-12-16 20:17:00.769076"], ["updated_at", "2015-12-16 20:17:00.769076"]]

    def edit
      @recipe = Recipe.find(params[:id])
      @categories = Category.all
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "categories".* FROM "categories"

    def update
        @recipe = Recipe.find(params[:id])
        @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "recipes" SET "category_id" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["category_id", 2], ["updated_at", "2015-12-16 20:38:43.929491"], ["id", 1]]